# Задача 3
# Вычислите площадь и периметр прямоугольника для введенных ширины и высоты.

print("Task 3")

a = int(input("input width: "))
b = int(input("input height: "))
print(" ")
print(((a + b)*2), " периметр" )
print((a * b), " площадь" )


