# Задача: распечатать каждый символ в строке.
# Task: Print each character in the string.

userName = input('Enter name: ')

for letter in userName:
    print(letter)